#### Terraform Plan 📋 `prod/argocd`

**Summary:** 11:25:45.510 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
11:24:43.370 WARN   Config ../kubernetes/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
11:24:44.169 STDOUT terraform: Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
11:24:44.169 STDOUT terraform: will stop streaming the logs, but will not stop the plan running remotely.
11:24:44.169 STDOUT terraform: Preparing the remote plan...
11:24:45.654 STDOUT terraform: To view this run in a browser, visit:
11:24:45.654 STDOUT terraform: https://app.terraform.io/app/my-devops-project/my-devops-project-prod-argocd/runs/run-fsA2V5uBP1K1pc1k
11:24:47.024 STDOUT terraform: Waiting for the plan to start...
11:25:38.444 STDOUT terraform: Terraform v1.14.0
11:25:38.444 STDOUT terraform: on linux_amd64
11:25:38.444 STDOUT terraform: Initializing plugins and modules...
11:25:42.193 STDOUT terraform: Invalid attribute in provider configuration
11:25:42.193 STDOUT terraform:   with provider["registry.terraform.io/hashicorp/kubernetes"],
11:25:42.193 STDOUT terraform:   on provider_k8s.tf line 2, in provider "kubernetes":
11:25:42.193 STDOUT terraform:    2: provider "kubernetes" {
11:25:42.193 STDOUT terraform: cluster_ca_certificate is not a valid PEM encoded certificate
11:25:45.508 STDOUT terraform: Terraform used the selected providers to generate the following execution
11:25:45.508 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
11:25:45.508 STDOUT terraform:   + create
11:25:45.508 STDOUT terraform: Terraform will perform the following actions:
11:25:45.508 STDOUT terraform:   # helm_release.argocd will be created
11:25:45.508 STDOUT terraform:   + resource "helm_release" "argocd" {
11:25:45.508 STDOUT terraform:       + atomic                     = true
11:25:45.508 STDOUT terraform:       + chart                      = "argo-cd"
11:25:45.508 STDOUT terraform:       + cleanup_on_fail            = false
11:25:45.508 STDOUT terraform:       + create_namespace           = false
11:25:45.508 STDOUT terraform:       + dependency_update          = false
11:25:45.508 STDOUT terraform:       + disable_crd_hooks          = false
11:25:45.508 STDOUT terraform:       + disable_openapi_validation = false
11:25:45.508 STDOUT terraform:       + disable_webhooks           = false
11:25:45.508 STDOUT terraform:       + force_update               = false
11:25:45.508 STDOUT terraform:       + id                         = (known after apply)
11:25:45.508 STDOUT terraform:       + lint                       = false
11:25:45.508 STDOUT terraform:       + max_history                = 0
11:25:45.508 STDOUT terraform:       + metadata                   = (known after apply)
11:25:45.508 STDOUT terraform:       + name                       = "argocd"
11:25:45.508 STDOUT terraform:       + namespace                  = "argocd"
11:25:45.508 STDOUT terraform:       + pass_credentials           = false
11:25:45.508 STDOUT terraform:       + recreate_pods              = false
11:25:45.509 STDOUT terraform:       + render_subchart_notes      = true
11:25:45.509 STDOUT terraform:       + replace                    = true
11:25:45.509 STDOUT terraform:       + repository                 = "https://argoproj.github.io/argo-helm"
11:25:45.509 STDOUT terraform:       + reset_values               = false
11:25:45.509 STDOUT terraform:       + reuse_values               = false
11:25:45.509 STDOUT terraform:       + set_wo                     = (write-only attribute)
11:25:45.509 STDOUT terraform:       + skip_crds                  = false
11:25:45.509 STDOUT terraform:       + status                     = "deployed"
11:25:45.509 STDOUT terraform:       + take_ownership             = false
11:25:45.509 STDOUT terraform:       + timeout                    = 1800
11:25:45.509 STDOUT terraform:       + upgrade_install            = false
11:25:45.509 STDOUT terraform:       + values                     = [
11:25:45.509 STDOUT terraform:           + <<-EOT
11:25:45.509 STDOUT terraform:                 global:
11:25:45.509 STDOUT terraform:                   tolerations:
11:25:45.509 STDOUT terraform:                     - key: "service"
11:25:45.509 STDOUT terraform:                       operator: "Equal"
11:25:45.509 STDOUT terraform:                       value: "monitoring"
11:25:45.509 STDOUT terraform:                       effect: "NoSchedule"
11:25:45.509 STDOUT terraform:                   nodeSelector:
11:25:45.509 STDOUT terraform:                     service: monitoring
11:25:45.509 STDOUT terraform:                 
11:25:45.509 STDOUT terraform:                 server:
11:25:45.509 STDOUT terraform:                   service:
11:25:45.509 STDOUT terraform:                     type: LoadBalancer
11:25:45.509 STDOUT terraform:                 
11:25:45.509 STDOUT terraform:                 configs:
11:25:45.509 STDOUT terraform:                   params:
11:25:45.509 STDOUT terraform:                     server.insecure: true
11:25:45.509 STDOUT terraform:             EOT,
11:25:45.509 STDOUT terraform:         ]
11:25:45.509 STDOUT terraform:       + verify                     = false
11:25:45.510 STDOUT terraform:       + version                    = "7.8.13"
11:25:45.510 STDOUT terraform:       + wait                       = true
11:25:45.510 STDOUT terraform:       + wait_for_jobs              = false
11:25:45.510 STDOUT terraform:     }
11:25:45.510 STDOUT terraform:   # kubernetes_namespace_v1.argocd will be created
11:25:45.510 STDOUT terraform:   + resource "kubernetes_namespace_v1" "argocd" {
11:25:45.510 STDOUT terraform:       + id                               = (known after apply)
11:25:45.510 STDOUT terraform:       + wait_for_default_service_account = false
11:25:45.510 STDOUT terraform:       + metadata {
11:25:45.510 STDOUT terraform:           + generation       = (known after apply)
11:25:45.510 STDOUT terraform:           + labels           = {
11:25:45.510 STDOUT terraform:               + "name" = "argocd"
11:25:45.510 STDOUT terraform:             }
11:25:45.510 STDOUT terraform:           + name             = "argocd"
11:25:45.510 STDOUT terraform:           + resource_version = (known after apply)
11:25:45.510 STDOUT terraform:           + uid              = (known after apply)
11:25:45.510 STDOUT terraform:         }
11:25:45.510 STDOUT terraform:     }
11:25:45.510 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
11:25:45.510 STDOUT terraform: Changes to Outputs:
11:25:45.510 STDOUT terraform:   + helm_release_name   = "argocd"
11:25:45.510 STDOUT terraform:   + helm_release_status = "deployed"
11:25:45.510 STDOUT terraform:   + namespace           = "argocd"
11:25:45.646 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
11:25:45.646 STDOUT terraform: Saved the plan to: tfplan
11:25:45.646 STDOUT terraform: To perform exactly these actions, run the following command to apply:
11:25:45.646 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*